lab2/performance.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5

scenarios:
  - name: "Create and delete product scenario"
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "admin@gmail.com"
            password: "123456"

      - post:
          url: "/products"
          json:
            name: "Performance Product"
            price: 999
          capture:
            - json: "$.id"
              as: "productId"

      - get:
          url: "/products"

      - delete:
          url: "/products/{{ productId }}"